app/Controllers/BukuController.php

SELECT COUNT(*) AS `numrows`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `buku_rak` ON `buku_rak`.`id_buku` = `buku`.`id_buku`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku_rak`.`id_rak`
SELECT `buku`.*, `kategori`.`nama_kategori`, `penulis`.`nama_penulis`, `penerbit`.`nama_penerbit`, `rak`.`nama_rak`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `buku_rak` ON `buku_rak`.`id_buku` = `buku`.`id_buku`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku_rak`.`id_rak`
 LIMIT 10
---
  public function index()
{
    $keyword = $this->request->getGet('keyword');

    if ($keyword) {
        $this->buku->like('judul', $keyword);
    }

    $data['buku'] = $this->buku
        ->select('buku.*, kategori.nama_kategori, penulis.nama_penulis, penerbit.nama_penerbit, rak.nama_rak')
        ->join('kategori', 'kategori.id_kategori = buku.id_kategori', 'left')
        ->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left')
        ->join('penerbit', 'penerbit.id_penerbit = buku.id_penerbit', 'left')
        ->join('buku_rak', 'buku_rak.id_buku = buku.id_buku', 'left')
        ->join('rak', 'rak.id_rak = buku_rak.id_rak', 'left')
        ->paginate(10);

SELECT *
FROM `kategori`
SELECT *
FROM `penulis`
SELECT *
FROM `penerbit`
---
    public function create()
{
    $data['kategori'] = $this->db->table('kategori')->get()->getResultArray();
    $data['penulis'] = $this->db->table('penulis')->get()->getResultArray();
    $data['penerbit'] = $this->db->table('penerbit')->get()->getResultArray();

UPDATE `buku` SET `judul` = 'Bumi', `isbn` = '9786020321111', `tahun_terbit` = '2014', `jumlah` = '5', `tersedia` = '5', `deskripsi` = 'iis sadiyah cantipp'
WHERE `buku`.`id_buku` IN ('28')
UPDATE `buku_rak` SET `id_rak` = '11'
WHERE `id_buku` = '28'
---
    public function update($id)
    {
        $data = $this->request->getPost();

        $this->buku->update($id, $data);

        $this->db->table('buku_rak')
            ->where('id_buku', $id)
            ->update(['id_rak' => $data['id_rak']]);

SELECT `buku`.*, `kategori`.`nama_kategori`, `penulis`.`nama_penulis`, `penerbit`.`nama_penerbit`, `rak`.`nama_rak`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `buku_rak` ON `buku_rak`.`id_buku` = `buku`.`id_buku`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku_rak`.`id_rak`
WHERE `buku`.`id_buku` = '28'
SELECT `ulasan`.*, `users`.`nama`
FROM `ulasan`
LEFT JOIN `users` ON `users`.`id` = `ulasan`.`id_anggota`
WHERE `ulasan`.`id_buku` = '28'
---
  public function detail($id)
{
    $data['buku'] = $this->db->table('buku')
        ->select('buku.*,
                  kategori.nama_kategori,
                  penulis.nama_penulis,
                  penerbit.nama_penerbit,
                  rak.nama_rak')
        ->join('kategori', 'kategori.id_kategori = buku.id_kategori', 'left')
        ->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left')
        ->join('penerbit', 'penerbit.id_penerbit = buku.id_penerbit', 'left')
        ->join('buku_rak', 'buku_rak.id_buku = buku.id_buku', 'left')
        ->join('rak', 'rak.id_rak = buku_rak.id_rak', 'left')
        ->where('buku.id_buku', $id)
        ->get()
        ->getRowArray();
        $ulasan = $this->db->table('ulasan')
    ->select('ulasan.*, users.nama')
    ->join('users', 'users.id = ulasan.id_anggota', 'left')
    ->where('ulasan.id_buku', $id)
    ->get()
    ->getResultArray();