app/Controllers/KategoriController.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $data['kategori'] = $this->kategori->findAll();