app/Controllers/LoginController.php

SELECT *
FROM `users`
WHERE `username` = 'Mutiara Nurul'
 LIMIT 1
---
    public function proses()
    {
        $model = new UsersModel();

        $request = \Config\Services::request();

        $username = $request->getPost('username');
        $password = $request->getPost('password');

        $user = $model->where('username', $username)->first();