app/Controllers/PeminjamanController.php

   public function index()
{
    $db = \Config\Database::connect();

    // Query untuk mengambil data peminjaman lengkap dengan nama anggota
    $builder = $db->table('peminjaman');
    $builder->select('peminjaman.*, users.nama as nama_anggota, COUNT(detail_peminjaman.id_buku) as jumlah_buku');

    // JOIN ke tabel anggota
    $builder->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota', 'left');

    // JOIN ke tabel users untuk ambil kolom NAMA
    $builder->join('users', 'users.id = anggota.user_id', 'left');

    // JOIN ke detail untuk hitung jumlah buku
    $builder->join('detail_peminjaman', 'detail_peminjaman.id_peminjaman = peminjaman.id_peminjaman', 'left');

    $builder->groupBy('peminjaman.id_peminjaman');
    $builder->orderBy('peminjaman.tanggal_pinjam', 'DESC');

    $data['peminjaman'] = $builder->get()->getResultArray();
---
SELECT `peminjaman`.*, `users`.`nama` as `nama_anggota`, COUNT(detail_peminjaman.id_buku) as jumlah_buku
FROM `peminjaman`
LEFT JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
LEFT JOIN `users` ON `users`.`id` = `anggota`.`user_id`
LEFT JOIN `detail_peminjaman` ON `detail_peminjaman`.`id_peminjaman` = `peminjaman`.`id_peminjaman`
GROUP BY `peminjaman`.`id_peminjaman`
ORDER BY `peminjaman`.`tanggal_pinjam` DESC

    public function store()
{
    $id_anggota = $this->request->getPost('id_anggota');
    $id_buku    = $this->request->getPost('id_buku');

    // Jika di form tidak ada input 'tanggal_pinjam', pakai tanggal hari ini
    $pinjam = $this->request->getPost('tanggal_pinjam') ?: date('Y-m-d');

    // Menghitung tanggal kembali (7 hari dari tanggal pinjam)
    $kembali = date('Y-m-d', strtotime($pinjam . ' +7 days'));

    // Cek apakah buku sudah dipilih atau belum untuk menghindari error foreach
    if (empty($id_buku)) {
        return redirect()->back()->with('error', 'Silahkan pilih minimal 1 buku!');
    }

    // 1. Simpan ke tabel peminjaman
    $this->peminjamanModel->save([
        'id_anggota'        => $id_anggota,
        'tanggal_pinjam'    => $pinjam,
        'tanggal_kembali'   => $kembali,
        'status'            => 'dipinjam',
        'jumlah_perpanjang' => 0
    ]);

    // Ambil ID peminjaman yang baru saja masuk
    $id_peminjaman = $this->peminjamanModel->insertID();

    // 2. Simpan detail buku yang dipinjam
    foreach ($id_buku as $b) {
        $this->db->table('detail_peminjaman')->insert([
            'id_peminjaman' => $id_peminjaman,
            'id_buku'       => $b,
            'jumlah'        => 1
        ]);
---
INSERT INTO `peminjaman` (`id_anggota`, `tanggal_pinjam`, `tanggal_kembali`, `status`) VALUES ('34', '2026-04-29', '2026-05-06', 'dipinjam')
INSERT INTO `detail_peminjaman` (`id_peminjaman`, `id_buku`, `jumlah`) VALUES (46, '37', 1)