app/Controllers/PenerbitController.php

    public function index()
    {
        $data['penerbit'] = $this->db->table('penerbit')
            ->select('id_penerbit, nama_penerbit, alamat')
            ->get()
            ->getResultArray();
---
SELECT `id_penerbit`, `nama_penerbit`, `alamat`
FROM `penerbit`