app/Controllers/PengembalianController.php

   public function index()
{
    $data['pengembalian'] = $this->db->table('pengembalian')
        ->select('
            pengembalian.*,
            peminjaman.id_peminjaman,
            users.nama
        ')
        ->join('peminjaman', 'peminjaman.id_peminjaman = pengembalian.id_peminjaman', 'left')
        ->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota', 'left')
        ->join('users', 'users.id = anggota.user_id', 'left')
        ->get()
        ->getResultArray();
---
SELECT `pengembalian`.*, `peminjaman`.`id_peminjaman`, `users`.`nama`
FROM `pengembalian`
LEFT JOIN `peminjaman` ON `peminjaman`.`id_peminjaman` = `pengembalian`.`id_peminjaman`
LEFT JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
LEFT JOIN `users` ON `users`.`id` = `anggota`.`user_id`

    public function edit($id)
{
    $data['pengembalian'] = $this->db->table('pengembalian')
        ->select('pengembalian.*')
        ->where('id_pengembalian', $id)
        ->get()
        ->getRowArray();

    // CEK JIKA DATA KOSONG
    if (!$data['pengembalian']) {
        return redirect()->to('/pengembalian')
            ->with('error', 'Data tidak ditemukan');
---
SELECT `pengembalian`.*, `peminjaman`.`id_peminjaman`, `users`.`nama`, `anggota`.`nis`
FROM `pengembalian`
LEFT JOIN `peminjaman` ON `peminjaman`.`id_peminjaman` = `pengembalian`.`id_peminjaman`
LEFT JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
LEFT JOIN `users` ON `users`.`id` = `anggota`.`user_id`
WHERE `pengembalian`.`id_pengembalian` = '1'

    public function kembalikan($id)
{
    // ambil data peminjaman
    $pinjam = $this->db->table('peminjaman')
        ->where('id_peminjaman', $id)
        ->get()
        ->getRowArray();

    if (!$pinjam) {
        return redirect()->back()->with('error', 'Data tidak ditemukan');
    }

    // CEK SUDAH DIKEMBALIKAN ATAU BELUM
    $cek = $this->db->table('pengembalian')
        ->where('id_peminjaman', $id)
        ->get()
        ->getRowArray();
---
SELECT *
FROM `peminjaman`
WHERE `id_peminjaman` = '45'
SELECT *
FROM `pengembalian`
WHERE `id_peminjaman` = '45'

    $status = ($denda > 0) ? 'Terlambat' : 'Tepat Waktu';

    // simpan ke pengembalian
    $this->db->table('pengembalian')->insert([
        'id_peminjaman' => $id,
        'tanggal_dikembalikan' => $today,
        'denda' => $denda,
        'status' => $status
    ]);

    // update peminjaman
    $this->db->table('peminjaman')->update([
        'status' => 'dikembalikan'
    ], ['id_peminjaman' => $id]);
---
INSERT INTO `pengembalian` (`id_peminjaman`, `tanggal_dikembalikan`, `denda`, `status`) VALUES ('45', '2026-04-29', 0, 'Tepat Waktu')
UPDATE `peminjaman` SET `status` = 'dikembalikan'
WHERE `id_peminjaman` = '45'