app/Controllers/PengembalianController.php

SELECT `detail_peminjaman`.*, `buku`.`judul`
FROM `detail_peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `detail_peminjaman`.`id_buku`
WHERE `detail_peminjaman`.`id_peminjaman` IS NULL
---
    public function detail($id)
    {
        $data['peminjaman'] = $this->db->table('pengembalian')
            ->select('
                pengembalian.*,
                peminjaman.id_peminjaman,
                users.nama,
                anggota.nis
            ')
            ->join('peminjaman', 'peminjaman.id_peminjaman = pengembalian.id_peminjaman', 'left')
            ->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota', 'left')
            ->join('users', 'users.id = anggota.user_id', 'left')
            ->where('pengembalian.id_pengembalian', $id)
            ->get()
            ->getRowArray();

        if (!$data['peminjaman']) {
            return redirect()->to('/pengembalian')
                ->with('error', 'Data tidak ditemukan');
        }

        $data['detail'] = $this->db->table('detail_peminjaman')
            ->select('detail_peminjaman.*, buku.judul')
            ->join('buku', 'buku.id_buku = detail_peminjaman.id_buku')
            ->where('detail_peminjaman.id_peminjaman', $data['peminjaman']['id_peminjaman'])
            ->get()
            ->getResultArray();