app/Controllers/PenulisController.php

    public function index()
    {
        $data['penulis'] = $this->penulis->findAll();
---
SELECT *
FROM `penulis`