app/Controllers/PetugasController.php

    public function index()
    {
        $data['petugas'] = $this->db->table('petugas')
            ->select('petugas.*, users.nama, users.username')
            ->join('users', 'users.id = petugas.user_id')
            ->get()
            ->getResultArray();
---
SELECT `petugas`.*, `users`.`nama`, `users`.`username`
FROM `petugas`
JOIN `users` ON `users`.`id` = `petugas`.`user_id`

    public function create()
    {
        $data['users'] = $this->db->table('users')
            ->whereIn('role', ['admin','petugas'])
            ->get()
            ->getResultArray();
---
SELECT *
FROM `users`
WHERE `role` IN ('admin','petugas')