app/Controllers/Users.php

SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
---
  public function index()
{
    $model = new \App\Models\UsersModel();

    $perPage = 10;

    $keyword = $this->request->getGet('keyword');
    $role    = $this->request->getGet('role');

    if ($keyword) {
        $model->like('nama', $keyword);
    }

    if ($role) {
        $model->where('role', $role);
    }

    //  INI BAGIAN YANG KAMU TANYA
    $data['users'] = $model->paginate($perPage);

SELECT *
FROM `users`
WHERE `users`.`id` = '12345'
---
    public function edit($id)
{
    $data['user'] = $this->users->find($id);